Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>pl-strflt</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.this["ac:main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOJnVklw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_repository.this["ab"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "ab"
        name                        = "ab"
        # (32 unchanged attributes hidden)

      + security_and_analysis {
          + advanced_security {
              + status = "disabled"
            }

          + secret_scanning {
              + status = "disabled"
            }

          + secret_scanning_push_protection {
              + status = "disabled"
            }
        }
    }

  # github_repository.this["ad"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "ad"
        name                        = "ad"
        # (32 unchanged attributes hidden)

      + security_and_analysis {
          + advanced_security {
              + status = "disabled"
            }

          + secret_scanning {
              + status = "disabled"
            }

          + secret_scanning_push_protection {
              + status = "disabled"
            }
        }
    }

  # github_repository_file.this["ac/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "ac"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["ad/.github/dependabot.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/dependabot.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            version: 2
            updates:
              - package-ecosystem: "github-actions"
                directory: "/"
                schedule:
                  interval: "weekly"
        EOT
      + file                = ".github/dependabot.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "ad"
      + sha                 = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->